{
    "C1": {
        "lower": {
            "description": "",
            "name": "North Towers",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "A merchant disterict offering legal goods and services of modest to comfortable quality.",
            "name": "Tradefair",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "Catering to Sharn's elite, this district provides a wide range of shops and services of wealthy and aristocratic quality.",
            "name": "Platinum Heights",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "C2": {
        "lower": {
            "description": "A haven for travelers, this district contains reliable inns ranging from modest to comfortable.",
            "name": "Boldrei's Hearth",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "A District filled with a vast assortment of temples and shrines. It is home to the two most important temples in sharn: the Pavilion of the Host and the Cathedral of the Cleansing Flame",
            "name": "Sovereign Towers",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "",
            "name": "Korran Thiven",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "C3": {
        "lower": {
            "description": "Neither the best nor the worst Sharn has to offer, Olladra's Kitchen is home to a wide number of taverns and restaurants of modest to comfortable quality.",
            "name": "Olladra's Kitchen",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "This garrison district houses the forces that police and defend Central Plateau, including the Sharn Watch and a detachment of the royal army.",
            "name": "Sword Point",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "Home to three sprawling rootop parks, this district provides a touch of wilderness in the heart of the city. A small community of immigrants from the Eldeen Reaches maintains these groves and gardens.",
            "name": "Skysedge Park",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "C4": {
        "lower": {
            "description": "",
            "name": "Granite Halls",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "This is the primary place to do business with representatives of the dragonmarked houses. All the houses have outposts here, and Sivis, Tharashk, Jorasco and Cannith have their primary enclaves in Dragon Towers.",
            "name": "Dragon Towers",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "The seat of city government, this district is also where airships arrive and depart.",
            "name": "Highest Towers",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "C5": {
        "lower": {
            "description": "",
            "name": "Vallia Towers",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "",
            "name": "Dava Gate",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "",
            "name": "Mithral Tower",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "C6": {
        "lower": {
            "description": "",
            "name": "Myshan Gardens",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "This district contains the embassies of the Thronehold nations, along with Aerenal and Riedra. It's also the seat of the Citadel and home to the Brelish Museum of Fine Art.",
            "name": "Ambassador Towers",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "Named after the great temple of Kol Korran that lies at its center, this district is dedicated to wealth and finance. Moneychangers, banks, and grand vaults are found here, in addition to the estates of powerful merchants.",
            "name": "Korranath",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "D1": {
        "lower": {
            "description": "The skydocs of Precarious pass goods between the towers and the port of the Dagger River below. The district is filled with warehouses, along with a handful of poor taverns. A small community of Sarlonans lives here.",
            "name": "Precarious",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "The center of Sharn's nightlife before Menthis Plateau was built, Underlook is a collection of poor taverns and inns.",
            "name": "Underlook",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "Overlook is Noteworthy for its kalashtar community, which maintains a community center, a shrine devoted to the Path of Light, and a few restaurants serving Sarlonan cuisine.",
            "name": "Overlook",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "D2": {
        "lower": {
            "description": "Another poor slum, largely home to dockworkers from Precarious.",
            "name": "Oldkeep",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "Once a proud residential district, Broken Arches has fallen into disrepair. Its housing is poor to modest in quality, though the shells of wealthy manors can still be seen.",
            "name": "Broken Arch",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "The finest residential district in Dura and the seat of House Vadalis, Highwater is largely comfortable in quality with a few wealthy estates.",
            "name": "Highwater",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "D3": {
        "lower": {
            "description": "A or district originally inhabited by gblins, Malleon's Gate has become a haven for monstous immigrants from Droaam and Darguun, along with members of Daask.",
            "name": "Malleon's Gate",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "A poor residential district, Tumbledown has experienced a recent incursion from Daask.",
            "name": "Tumbledown",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "This district caters to adventurers, with a wide array of buisnesses aimed at explorers and fortune hunters. It is the home base of the Clifftop Adventurers' Guild.",
            "name": "Clifftop",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "D4": {
        "lower": {
            "description": "A squalid slum, providing miserable housing for desperate people.",
            "name": "Gate of Gold",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "A jumble of architectural styles, Hareth's Folly is a place to gamble and enjoy modest food and drink. The Hollow Tower is a center for aerial sports, and Hareth's Folly is where the Race of Eight Winds begins and ends.",
            "name": "Hareth's Folly",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "A relatively new temple district, with shrines and churches that relocated from the Fallen in lower Dura. Hope's Peak includes several monasteries and sacred groves.",
            "name": "Hope's Peak",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "D5": {
        "lower": {
            "description": "Home to an assortment of squalid and poor businesses, Callastan is a nexus for criminal activity and known as a stronghold of the Boromar Clan.",
            "name": "Callestan",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "The largest commercial district in Sharn, an excellent place to buy and sell used -- and possibly stolen -- goods.",
            "name": "The Bazaar",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "",
            "name": "Redstone",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "D6": {
        "lower": {
            "description": "A warehhouse district with a large halfling population, with ties to the Borromar Clan.",
            "name": "The Stores",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "A comfortable residential district, Stormhold is home to the few powerful families that have remained in Dura. It's in better condition than most of Middle Dura, and Deneith mercenaries protect the streetsm.",
            "name": "Stormhold",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "Daggerwatch holds garrisons for both the Sharn Watch and the Brelish armym, along with business and residences for those who support the garrisons",
            "name": "Daggerwatch",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "D7": {
        "lower": {
            "description": "Sharn's oldest temple district, Fallen was abandoned after a floating tower crashed into the district during the Last War. Now it's a collection of wretched ruins.",
            "name": "Fallen",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "Rattlestone is a tenement district. Its people have little but their pride, but there's a strong cammaraderie between them.",
            "name": "Rattlestone",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "A district built by dwarves for dwarves, Highhold has a strong Mror influences in its architecture. It's a good place to find Mror goods and its home to talented smiths and brewers.",
            "name": "Highhold",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "M1": {
        "lower": {
            "description": "A district with a notorious reputation, celebrated for cheap enterntainment and infamous for its dangerus alleys. Its theaters secialize in musical comedy and lwbrow",
            "name": "Torchfire",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "Safer than the llower wards and less expensive than Upper Menthis, Smokey Towers has plenty of entertainment options. Smokey Towers has become a haven for Cyran refugees wealthy enough to avoid High Walls.",
            "name": "Smoky Towers",
            "notableLocations": {
                "description": ["Smokey Towers most popular venue.", "An intimate dinner theater known for its interactive performances.", "A burlesque theater run by changelings.", "Thovanic Hall has begun performing works from Darguun and Droaam featuring monsterous performers."],
                "name": ["Classic Theater", "Dinner theater", "changeling burlesque", "Thovanic Hall"]
            }
        },
        "upper": {
            "description": "Founded by gnome immigrants from Zilargo, Den'iyas is a haven for those interested in Zil culture. It's home to many sages and artisans, and a hotbed of schemes and intrigue.",
            "name": "Den'iyas",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "M2": {
        "lower": {
            "description": "This district is a destination for those who seek ilicit forms of entertainment. Many forms of illigal gambling and paid companionship can be found in Firelight. It's als the most common location of the Burning Ring.",
            "name": "Firelight",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "Founded by Talenta halflings, this district includes a central campground for visiting halfling nomads. The permanent residents are mostly halflings as well. Talenta foods and crafts can be found here, along the displays of traditional skills and pastimes.",
            "name": "Little Plains",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "",
            "name": "Platinate",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "M3": {
        "lower": {
            "description": "",
            "name": "Center Bridge",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "This district is a source of magical goods and services. Exotic components, magewrights for hire. common and uncommon magic items--all of these can be found here.",
            "name": "Everbright",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "This district is dominated by Morgrave Uniersity. It's also a nexus for sophisticated entertainment.",
            "name": "University District",
            "notableLocations": {
                "description": [" ",  " ", " ", " "],
                "name": ["Morgrave University", "the Art Temple", "the Grand Stage", "the Grand Hall of Aureon"]
            }
        }
    },
    "M4": {
        "lower": {
            "description": "The Downstairs district is primarily known for food and drinks. Though most of its taverns and inns are only modest in quality.",
            "name": "Downstairs",
            "notableLocations": {
                "description": [" serves some of the finest seafood in Sharn", "  is a recently successful venue, known for its avant-garde performances."],
                "name": ["the Four Snails", "Diamond Theater"]
            }
        },
        "middle": {
            "description": "A mercentile district with goods of modest to comfotable quality. Home to a significant number of immigrants from the Shadow Marches, Cassan Bridge is the place to visit for exotic Marcher herbs and cuisine.",
            "name": "Cassan Bridge",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "A shopping district, with resteraunts and goods of comfortable to wealthy quality.",
            "name": "Seventh Tower",
            "notableLocations": {
                "description": [" a collection of galleries whose owners buy and sell goods from Xen'drik."],
                "name": ["Little Xen'drik"]
            }
        }
    },
    "M5": {
        "lower": {
            "description": "",
            "name": "Forgelight Towers",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "This district is the primary garrison of the Sharn Watch in Menthis. It's home to a community of Lhazaar immigrants.",
            "name": "Warden Towers",
            "notableLocations": {
                "description": [" a tavern catering to Lhazaar travelers."],
                "name": ["Broken Anchor"]
            }
        },
        "upper": {
            "description": "This residential district includes comfortable homes and modest apartments. Many of the student and faculty of Morgrave University live in Ivy Towers. ",
            "name": "Ivy Towers",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "N1": {
        "lower": {
            "description": "The population of this peaceful residential district is mostly made up of dwarves, humand and half-eves. Neighbors here generally stand together to deal with trouble.",
            "name": "Longstairs",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "A center of worship for the people of Northedge, High Hope includes temples of the Silver Flame and the Sovereign Host, along with smaller shrines. It lacks the grandeur of Sovereign Towers in Central Plateau, but has an atmosphere of solemn devotion.",
            "name": "High Hope",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "This district is a bastion for the culture and traditions of the elves of Aerenal. It includes a variety of businesses specializing in Aerenal goods, as well as a temple to the Undying Court.",
            "name": "Shae Lias",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "N2": {
        "lower": {
            "description": "This residential district is home to the majority of Sharn's shifters, including both recent immigrants from the Edeen Reaches and long established local families. Conditions are poor to modest.",
            "name": "Stoneyard",
            "notableLocations": {
                "description": [" ", " "],
                "name": ["makeshift hrazhak court", "shrine to the Wardens of the Wood"]
            }
        },
        "middle": {
            "description": "",
            "name": "Oakbridge",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "A residential district where housing ranges from comfortable to aristocratic. Construction in Oak Towers uses materials and styles drawn from Aerenal, and the district is home to many of Sharn's established elf and half-elf families.",
            "name": "Oak Towers",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "N3": {
        "lower": {
            "description": "The open market in this region largely deals in simple, locally produced goods. Due to the significant shifter population in Lower Northedge, North Market offers goods and services aimed at shifters (grooming services, claw care and so forth) as well as reflecting an Eldeen influence.",
            "name": "North Market",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "Holdfast is the heart of Sharn's dwarf population. The ancestors of the Holdfast dwarves helped build Sharn and many of its people are stonemasons, architects, and smiths. Holdfast dwarves are proud of their Sharn roots and have little interest in Mror customs and traditions.",
            "name": "Holdfast",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "A peacuful residential district with many wealthy and aristocratic estates.",
            "name": "Crystal Bridge",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "T1": {
        "lower": {
            "description": "This district is based around Terminus Station, where the lightning rail enters and leaves Sharn. Most local businesses serve the station or the travelers.",
            "name": "Terminus",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "This district specializes in produce and other goods brought in by farmers froom the surrounding countryside.",
            "name": "Tavick's Market",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "This shopping district is patronized by those with gold to spare. All manner of fine jewelry and expensive clothing can be found here, along with aristocratic food and lodging.",
            "name": "Silvergate",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "T2": {
        "lower": {
            "description": "Travelers who arrive on the main road enter Sharn through Wroann's Gate, passing below a huge statue of the legendary Queen Wroaan. Many of the dragonmarked houses maintain shops here so travelers can send messages, hire bodyguards, or make use of other services.",
            "name": "Wroann's Gate",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "A haven for travelers, Cornerstone has a range from comfortable inns and taverns. It's built around the vast Cornerstone arena and is the center of activity for many major sporting events.",
            "name": "Cornerstone",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "",
            "name": "Pinnacle",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "T3": {
        "lower": {
            "description": "This warehouse district is the gateway to the Cogs, and shipments of ore and other goods regularly pass through here. House Kundarak has high-security facilities for rent, and a House Deneith outpost hires out Blademark mercenaries for ventures below.",
            "name": "Cogsgate",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "This district was funded long ago by Karnathi immigrants, and its people are proud of their heritage. Its a haven for any Karnathi travelers passing through Sharn. Rumours say there's a temple devoted to the Blood of Vol in Greywall, but if that's the case, it's kept hidden.",
            "name": "Graywall",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "This is the civic heart of Upper Travick's Landing. The Twelve Pillars are named for the twelve columns that surround the courthouse, known as the Tower of Law, where visitors can obtain a license to carry weapons in the ward.",
            "name": "Twelve Pillars",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "T4": {
        "lower": {
            "description": "This district was converted into an internment center during the Last War. Since the end of the war, its been transformed into a refugee camp. Most of the residents are Cyrans who fled the Mourning, but High Walls includes Brelish citizens who lost their homes in the war. It's a crowded and dangerous place, but allows the residents to maintain a squalid lifestyle at no cost. Currently the gates are open, but the Sharn Watch could seal them at any time.",
            "name": "High Walls",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "",
            "name": "Dancing Shadows",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "This district is built around the Deneith garrison that polices the upper ward. It cntains shops and services catering to the wealthy elite.",
            "name": "Copper Arch",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "T5": {
        "lower": {
            "description": "Dragoneyes tends to the needs of weary travelers, providing a wide range of lodging, food, and entertainment foor tourists. It's also the home of most of Sharn's changeling population, and many chengelings use their gifts to entertain and amuse travelers. Some say that its the home of the Tyrants criminal guild, but if so, that place is well hidden.",
            "name": "Dragoneyes",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "Named for the nearby City of the Dead, this district houses the Deathsgate Guild and businesses that cater to adventurers. House Deneith recruits merceneries at its outpst here.",
            "name": "Deathsgate",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "",
            "name": "Dalan's Refuge",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "T6": {
        "lower": {
            "description": "This district is filled with checkpoints and enchanted gates. these portals are generally open, but in times of trouble, Black Arch can become a impassible fortress. the Sharn Watch maintains the local garrison. House Orien and House Sivis bth maintain outposts here, ensuring that messages can be swiftly delivered through the city and beyond.",
            "name": "Black Arch",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "",
            "name": "Little Barrington",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "This residential district is home to some of the most influential citizens of Sharn. It has a mix of wealthy mansions and aristocratic estates.",
            "name": "Ocean View",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "T7": {
        "lower": {
            "description": "",
            "name": "Foundation",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "middle": {
            "description": "",
            "name": "Kenton",
            "notableLocations": {
                "description": [],
                "name": []
            }
        },
        "upper": {
            "description": "This district provides housing fr the shopkeepers and servants who keep Upper Travick's Landing running. Housing is largly modest in quality, with a few comfortable towers.",
            "name": "Sunrise",
            "notableLocations": {
                "description": [],
                "name": []
            }
        }
    },
    "central": {
        "description": "",
        "name": "Central Plateau"
    },
    "cliffside": {
        "description": "Boats bring cargo and passangers to the docks at Cliffside, on the edge of the Dagger River. From there, enormous lifts carry people up to Precarious. This dangerous district contains an assortment of taverns, shabby inns, and warehouses. ",
        "name": "Cliffside"
    },
    "dura": {
        "description": "",
        "name": "Dura"
    },
    "grayflood": {
        "description": "",
        "name": "Grayflood",
        "notableLocations": {
            "description": [],
            "name": []
        }
    },
    "menthis": {
        "description": "",
        "name": "Menthis Plateau"
    },
    "mudCaves": {
        "description": "",
        "name": "Mud Caves",
        "notableLocations": {
            "description": [],
            "name": []
        }
    },
    "northedge": {
        "description": "",
        "name": "Northedge"
    },
    "sharnsWelcome": {
        "description": "",
        "name": "Sharn's Welcome",
        "notableLocations": {
            "description": [],
            "name": []
        }
    },
    "shipsTowers": {
        "description": "",
        "name": "Ship's Towers",
        "notableLocations": {
            "description": [],
            "name": []
        }
    },
    "tavicks": {
        "description": "",
        "name": "Tavick's Landing"
    }
}